In [21]:
import pandas as pd

df = pd.read_csv('template.csv')
df

   column1   column2   column3   column4
0   value1    value2    value3    value4
1   value5    value6    value7    value8
2   value9   value10   value11   value12
3  value13   value14   value15   value16
4  value17   value18   value19   value20

In [22]:
df.shape

(5, 4)

In [23]:
df.describe()

       column1  column2  column3  column4
count        5        5        5        5
unique       5        5        5        5
top     value1   value2   value3   value4
freq         1        1        1        1

In [24]:
df.values

array([['value1', ' value2', ' value3', ' value4'],
       ['value5', ' value6', ' value7', ' value8'],
       ['value9', ' value10', ' value11', ' value12'],
       ['value13', ' value14', ' value15', ' value16'],
       ['value17', ' value18', ' value19', ' value20']], dtype=object)